flashdeal-core/scripts/benchmark-results.txt
========================================
FlashDeal 压测报告
========================================

========================================
【最新】风控压测（含风控模块）
========================================

测试时间: 2026-07-17
测试工具: wrk 4.2.0
测试参数: 4 线程 / 100 连接 / 30 秒
压测用户: 5000（risk_tokens.txt，含 5% 羊毛党画像）
秒杀库存: 100
目标接口: POST /user/seckill/1

wrk 原始输出:
  Running 30s test @ http://localhost:8080
    4 threads and 100 connections
    Thread Stats   Avg      Stdev     Max   +/- Stdev
      Latency     4.98ms    5.14ms  65.28ms   82.47%
      Req/Sec     7.05k     3.31k   13.14k    61.26%
    844121 requests in 30.09s, 132.36MB read
    Non-2xx or 3xx responses: 753718
  Requests/sec:  28054.98
  Transfer/sec:      4.40MB

业务分类统计:
总请求:       844,121  |  QPS: 28,055

限流拦截:     753,718  (89.29%)  ← Redisson RRateLimiter 全局限流
风控拦截:      86,036  (10.19%)  ← 决策树模型识别可疑请求
库存不足:       4,079  (0.48%)   ← Lua 脚本原子预扣拒绝
重复下单:         188  (0.02%)   ← Lua sadd 判重拦截
成功/处理中:      100  (0.01%)   ← 最终订单创建成功数

延迟: avg=4.98ms  p50=1.95ms  p99=18.48ms

关键验证结论:
超卖防护:  0 超卖                    ✅ 通过
重复下单:  188 次被拦截              ✅ 通过
库存精准:  100 库存 → 100 订单       ✅ 通过
限流效果:  ~3000 req/s 放行          ✅ 通过
风控拦截:  10.19% 可疑请求被拦截     ✅ 通过
响应时间:  p99 = 18.48ms            ✅ 优秀

分层防御分析:
第 1 层 - 限流:  89.29% 请求被拦截，保护系统不被压垮
第 2 层 - 风控:  10.19% 可疑请求被决策树模型拦截（羊毛党/模拟器）
第 3 层 - Lua:   0.48% 请求因库存不足被拒绝
第 4 层 - DB:    乐观锁 + 唯一索引兜底，0 超卖 0 少卖


========================================
【历史】基础压测（风控模块接入前）
========================================

测试时间: 2026-07-16
测试工具: wrk 4.2.0
测试参数: 8 线程 / 200 连接 / 30 秒
压测用户: 5000（tokens.txt）
秒杀库存: 100
目标接口: POST /user/seckill/1

wrk 原始输出:
  Running 30s test @ http://localhost:8080
    8 threads and 200 connections
    Thread Stats   Avg      Stdev     Max   +/- Stdev
      Latency     7.03ms    6.82ms  88.12ms   81.53%
      Req/Sec     5.05k     2.41k   12.68k    60.18%
    1209772 requests in 30.09s, 189.68MB read
    Non-2xx or 3xx responses: 1108670
  Requests/sec:  40200.33
  Transfer/sec:      6.30MB

业务分类统计:
总请求:     1,209,772  |  QPS: 40,200

限流拦截:   1,108,670  (92.43%)  ← Redisson RRateLimiter 全局限流
库存不足:      90,300  (7.53%)   ← Lua 脚本原子预扣拒绝
重复下单:         453  (0.04%)   ← Lua sadd 判重拦截
成功/处理中:      100  (0.01%)   ← 最终订单创建成功数

延迟: avg=7.03ms  p50=2.44ms  p99=27.31ms

关键验证结论:
超卖防护:  0 超卖                    ✅ 通过
重复下单:  453 次被拦截              ✅ 通过
库存精准:  100 库存 → 100 订单       ✅ 通过
限流效果:  ~3000 req/s 放行          ✅ 通过
响应时间:  p99 = 27.31ms            ✅ 优秀

分层防御分析:
第 1 层 - 限流:  92.43% 请求被拦截，保护系统不被压垮
第 2 层 - Lua:   7.53% 请求因库存不足被拒绝
第 3 层 - DB:    乐观锁 + 唯一索引兜底，0 超卖 0 少卖


========================================
单用户重复下单拒绝时间测试
========================================

测试时间: 2026-07-17
测试工具: wrk 4.2.0
测试参数: 1 线程 / 1 连接 / 10 秒
压测用户: 1（risk_tokens.txt 首条 token）
秒杀库存: 100
目标接口: POST /user/seckill/1

wrk 原始输出:
  Running 10s test @ http://localhost:8080
    1 threads and 1 connections
    Thread Stats   Avg      Stdev     Max   +/- Stdev
      Latency     1.19ms  186.87us   7.60ms   95.60%
      Req/Sec   841.53     40.04     0.90k    84.00%
    8384 requests in 10.01s, 1.54MB read
  Requests/sec:    837.79
  Transfer/sec:    157.21KB

业务分类统计:
总请求:           8,384
成功(首次):           1
拒绝(重复/风控):  8,383
其他:                 0

延迟(全部): avg=1.19ms  p50=1.17ms  p99=1.79ms

结论:
单用户重复下单被拒绝的平均响应时间 ≈ 1.2ms，p99 < 2ms，拒绝速度极快。